loadtest/results/2026-08-12_feed-auth_run3_raw.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: feed-auth.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 4m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 001/200 VUs, 32 complete and 0 interrupted iterations
default   [   0% ] 001/200 VUs  0m00.8s/4m00.0s

running (0m01.9s), 002/200 VUs, 84 complete and 0 interrupted iterations
default   [   1% ] 002/200 VUs  0m01.8s/4m00.0s

running (0m02.9s), 002/200 VUs, 166 complete and 0 interrupted iterations
default   [   1% ] 002/200 VUs  0m02.8s/4m00.0s

running (0m03.9s), 003/200 VUs, 270 complete and 0 interrupted iterations
default   [   2% ] 003/200 VUs  0m03.8s/4m00.0s

running (0m04.9s), 004/200 VUs, 393 complete and 0 interrupted iterations
default   [   2% ] 004/200 VUs  0m04.8s/4m00.0s

running (0m05.9s), 004/200 VUs, 562 complete and 0 interrupted iterations
default   [   2% ] 004/200 VUs  0m05.8s/4m00.0s

running (0m06.9s), 005/200 VUs, 730 complete and 0 interrupted iterations
default   [   3% ] 005/200 VUs  0m06.8s/4m00.0s

running (0m07.9s), 005/200 VUs, 903 complete and 0 interrupted iterations
default   [   3% ] 005/200 VUs  0m07.8s/4m00.0s

running (0m08.9s), 006/200 VUs, 1072 complete and 0 interrupted iterations
default   [   4% ] 006/200 VUs  0m08.8s/4m00.0s

running (0m09.9s), 007/200 VUs, 1239 complete and 0 interrupted iterations
default   [   4% ] 007/200 VUs  0m09.8s/4m00.0s

running (0m10.9s), 007/200 VUs, 1402 complete and 0 interrupted iterations
default   [   4% ] 007/200 VUs  0m10.8s/4m00.0s

running (0m11.9s), 008/200 VUs, 1573 complete and 0 interrupted iterations
default   [   5% ] 008/200 VUs  0m11.8s/4m00.0s

running (0m12.9s), 009/200 VUs, 1726 complete and 0 interrupted iterations
default   [   5% ] 009/200 VUs  0m12.8s/4m00.0s

running (0m13.9s), 009/200 VUs, 1859 complete and 0 interrupted iterations
default   [   6% ] 009/200 VUs  0m13.8s/4m00.0s

running (0m14.9s), 010/200 VUs, 2020 complete and 0 interrupted iterations
default   [   6% ] 010/200 VUs  0m14.8s/4m00.0s

running (0m15.9s), 011/200 VUs, 2187 complete and 0 interrupted iterations
default   [   7% ] 011/200 VUs  0m15.8s/4m00.0s

running (0m16.9s), 011/200 VUs, 2356 complete and 0 interrupted iterations
default   [   7% ] 011/200 VUs  0m16.8s/4m00.0s

running (0m17.9s), 012/200 VUs, 2523 complete and 0 interrupted iterations
default   [   7% ] 012/200 VUs  0m17.8s/4m00.0s

running (0m18.9s), 012/200 VUs, 2693 complete and 0 interrupted iterations
default   [   8% ] 012/200 VUs  0m18.8s/4m00.0s

running (0m19.9s), 013/200 VUs, 2862 complete and 0 interrupted iterations
default   [   8% ] 013/200 VUs  0m19.8s/4m00.0s

running (0m20.9s), 014/200 VUs, 3023 complete and 0 interrupted iterations
default   [   9% ] 014/200 VUs  0m20.8s/4m00.0s

running (0m21.9s), 014/200 VUs, 3193 complete and 0 interrupted iterations
default   [   9% ] 014/200 VUs  0m21.8s/4m00.0s

running (0m22.9s), 015/200 VUs, 3347 complete and 0 interrupted iterations
default   [   9% ] 015/200 VUs  0m22.8s/4m00.0s

running (0m23.9s), 016/200 VUs, 3486 complete and 0 interrupted iterations
default   [  10% ] 016/200 VUs  0m23.8s/4m00.0s

running (0m24.9s), 016/200 VUs, 3654 complete and 0 interrupted iterations
default   [  10% ] 016/200 VUs  0m24.8s/4m00.0s

running (0m25.9s), 017/200 VUs, 3823 complete and 0 interrupted iterations
default   [  11% ] 017/200 VUs  0m25.8s/4m00.0s

running (0m26.9s), 017/200 VUs, 3998 complete and 0 interrupted iterations
default   [  11% ] 017/200 VUs  0m26.8s/4m00.0s

running (0m27.9s), 018/200 VUs, 4169 complete and 0 interrupted iterations
default   [  12% ] 018/200 VUs  0m27.8s/4m00.0s

running (0m28.9s), 019/200 VUs, 4344 complete and 0 interrupted iterations
default   [  12% ] 019/200 VUs  0m28.8s/4m00.0s

running (0m29.9s), 019/200 VUs, 4517 complete and 0 interrupted iterations
default   [  12% ] 019/200 VUs  0m29.8s/4m00.0s

running (0m30.9s), 020/200 VUs, 4676 complete and 0 interrupted iterations
default   [  13% ] 020/200 VUs  0m30.8s/4m00.0s

running (0m31.9s), 021/200 VUs, 4850 complete and 0 interrupted iterations
default   [  13% ] 021/200 VUs  0m31.8s/4m00.0s

running (0m32.9s), 021/200 VUs, 5000 complete and 0 interrupted iterations
default   [  14% ] 021/200 VUs  0m32.8s/4m00.0s

running (0m33.9s), 022/200 VUs, 5144 complete and 0 interrupted iterations
default   [  14% ] 022/200 VUs  0m33.8s/4m00.0s

running (0m34.9s), 023/200 VUs, 5310 complete and 0 interrupted iterations
default   [  14% ] 023/200 VUs  0m34.8s/4m00.0s

running (0m35.9s), 023/200 VUs, 5479 complete and 0 interrupted iterations
default   [  15% ] 023/200 VUs  0m35.8s/4m00.0s

running (0m36.9s), 024/200 VUs, 5652 complete and 0 interrupted iterations
default   [  15% ] 024/200 VUs  0m36.8s/4m00.0s

running (0m37.9s), 025/200 VUs, 5822 complete and 0 interrupted iterations
default   [  16% ] 025/200 VUs  0m37.8s/4m00.0s

running (0m38.9s), 025/200 VUs, 5992 complete and 0 interrupted iterations
default   [  16% ] 025/200 VUs  0m38.8s/4m00.0s

running (0m39.9s), 026/200 VUs, 6166 complete and 0 interrupted iterations
default   [  17% ] 026/200 VUs  0m39.8s/4m00.0s

running (0m40.9s), 027/200 VUs, 6333 complete and 0 interrupted iterations
default   [  17% ] 027/200 VUs  0m40.8s/4m00.0s

running (0m41.9s), 027/200 VUs, 6497 complete and 0 interrupted iterations
default   [  17% ] 027/200 VUs  0m41.8s/4m00.0s

running (0m42.9s), 028/200 VUs, 6668 complete and 0 interrupted iterations
default   [  18% ] 028/200 VUs  0m42.8s/4m00.0s

running (0m43.9s), 029/200 VUs, 6819 complete and 0 interrupted iterations
default   [  18% ] 029/200 VUs  0m43.8s/4m00.0s

running (0m44.9s), 029/200 VUs, 6958 complete and 0 interrupted iterations
default   [  19% ] 029/200 VUs  0m44.8s/4m00.0s

running (0m45.9s), 030/200 VUs, 7128 complete and 0 interrupted iterations
default   [  19% ] 030/200 VUs  0m45.8s/4m00.0s

running (0m46.9s), 031/200 VUs, 7293 complete and 0 interrupted iterations
default   [  19% ] 031/200 VUs  0m46.8s/4m00.0s

running (0m47.9s), 031/200 VUs, 7463 complete and 0 interrupted iterations
default   [  20% ] 031/200 VUs  0m47.8s/4m00.0s

running (0m48.9s), 032/200 VUs, 7633 complete and 0 interrupted iterations
default   [  20% ] 032/200 VUs  0m48.8s/4m00.0s

running (0m49.9s), 033/200 VUs, 7802 complete and 0 interrupted iterations
default   [  21% ] 033/200 VUs  0m49.8s/4m00.0s

running (0m50.9s), 033/200 VUs, 7971 complete and 0 interrupted iterations
default   [  21% ] 033/200 VUs  0m50.8s/4m00.0s

running (0m51.9s), 034/200 VUs, 8126 complete and 0 interrupted iterations
default   [  22% ] 034/200 VUs  0m51.8s/4m00.0s

running (0m52.9s), 035/200 VUs, 8296 complete and 0 interrupted iterations
default   [  22% ] 035/200 VUs  0m52.8s/4m00.0s

running (0m53.9s), 035/200 VUs, 8444 complete and 0 interrupted iterations
default   [  22% ] 035/200 VUs  0m53.8s/4m00.0s

running (0m54.9s), 036/200 VUs, 8580 complete and 0 interrupted iterations
default   [  23% ] 036/200 VUs  0m54.8s/4m00.0s

running (0m55.9s), 037/200 VUs, 8746 complete and 0 interrupted iterations
default   [  23% ] 037/200 VUs  0m55.8s/4m00.0s

running (0m56.9s), 037/200 VUs, 8910 complete and 0 interrupted iterations
default   [  24% ] 037/200 VUs  0m56.8s/4m00.0s

running (0m57.9s), 038/200 VUs, 9078 complete and 0 interrupted iterations
default   [  24% ] 038/200 VUs  0m57.8s/4m00.0s

running (0m58.9s), 039/200 VUs, 9248 complete and 0 interrupted iterations
default   [  24% ] 039/200 VUs  0m58.8s/4m00.0s

running (0m59.9s), 039/200 VUs, 9414 complete and 0 interrupted iterations
default   [  25% ] 039/200 VUs  0m59.8s/4m00.0s

running (1m00.9s), 040/200 VUs, 9583 complete and 0 interrupted iterations
default   [  25% ] 040/200 VUs  1m00.8s/4m00.0s

running (1m01.9s), 041/200 VUs, 9743 complete and 0 interrupted iterations
default   [  26% ] 041/200 VUs  1m01.8s/4m00.0s

running (1m02.9s), 041/200 VUs, 9907 complete and 0 interrupted iterations
default   [  26% ] 041/200 VUs  1m02.8s/4m00.0s

running (1m03.9s), 042/200 VUs, 10057 complete and 0 interrupted iterations
default   [  27% ] 042/200 VUs  1m03.8s/4m00.0s

running (1m04.9s), 043/200 VUs, 10192 complete and 0 interrupted iterations
default   [  27% ] 043/200 VUs  1m04.8s/4m00.0s

running (1m05.9s), 043/200 VUs, 10351 complete and 0 interrupted iterations
default   [  27% ] 043/200 VUs  1m05.8s/4m00.0s

running (1m06.9s), 044/200 VUs, 10520 complete and 0 interrupted iterations
default   [  28% ] 044/200 VUs  1m06.8s/4m00.0s

running (1m07.9s), 045/200 VUs, 10684 complete and 0 interrupted iterations
default   [  28% ] 045/200 VUs  1m07.8s/4m00.0s

running (1m08.9s), 045/200 VUs, 10853 complete and 0 interrupted iterations
default   [  29% ] 045/200 VUs  1m08.8s/4m00.0s

running (1m09.9s), 046/200 VUs, 11020 complete and 0 interrupted iterations
default   [  29% ] 046/200 VUs  1m09.8s/4m00.0s

running (1m10.9s), 047/200 VUs, 11190 complete and 0 interrupted iterations
default   [  29% ] 047/200 VUs  1m10.8s/4m00.0s

running (1m11.9s), 047/200 VUs, 11350 complete and 0 interrupted iterations
default   [  30% ] 047/200 VUs  1m11.8s/4m00.0s

running (1m12.9s), 048/200 VUs, 11512 complete and 0 interrupted iterations
default   [  30% ] 048/200 VUs  1m12.8s/4m00.0s

running (1m13.9s), 049/200 VUs, 11673 complete and 0 interrupted iterations
default   [  31% ] 049/200 VUs  1m13.8s/4m00.0s

running (1m14.9s), 049/200 VUs, 11810 complete and 0 interrupted iterations
default   [  31% ] 049/200 VUs  1m14.8s/4m00.0s

running (1m15.9s), 050/200 VUs, 11959 complete and 0 interrupted iterations
default   [  32% ] 050/200 VUs  1m15.8s/4m00.0s

running (1m16.9s), 051/200 VUs, 12125 complete and 0 interrupted iterations
default   [  32% ] 051/200 VUs  1m16.8s/4m00.0s

running (1m17.9s), 051/200 VUs, 12289 complete and 0 interrupted iterations
default   [  32% ] 051/200 VUs  1m17.8s/4m00.0s

running (1m18.9s), 052/200 VUs, 12456 complete and 0 interrupted iterations
default   [  33% ] 052/200 VUs  1m18.8s/4m00.0s

running (1m19.9s), 053/200 VUs, 12620 complete and 0 interrupted iterations
default   [  33% ] 053/200 VUs  1m19.8s/4m00.0s

running (1m20.9s), 053/200 VUs, 12787 complete and 0 interrupted iterations
default   [  34% ] 053/200 VUs  1m20.8s/4m00.0s

running (1m21.9s), 054/200 VUs, 12947 complete and 0 interrupted iterations
default   [  34% ] 054/200 VUs  1m21.8s/4m00.0s

running (1m22.9s), 055/200 VUs, 13109 complete and 0 interrupted iterations
default   [  34% ] 055/200 VUs  1m22.8s/4m00.0s

running (1m23.9s), 055/200 VUs, 13270 complete and 0 interrupted iterations
default   [  35% ] 055/200 VUs  1m23.8s/4m00.0s

running (1m24.9s), 056/200 VUs, 13403 complete and 0 interrupted iterations
default   [  35% ] 056/200 VUs  1m24.8s/4m00.0s

running (1m25.9s), 057/200 VUs, 13552 complete and 0 interrupted iterations
default   [  36% ] 057/200 VUs  1m25.8s/4m00.0s

running (1m26.9s), 057/200 VUs, 13718 complete and 0 interrupted iterations
default   [  36% ] 057/200 VUs  1m26.8s/4m00.0s

running (1m27.9s), 058/200 VUs, 13880 complete and 0 interrupted iterations
default   [  37% ] 058/200 VUs  1m27.8s/4m00.0s

running (1m28.9s), 059/200 VUs, 14042 complete and 0 interrupted iterations
default   [  37% ] 059/200 VUs  1m28.8s/4m00.0s

running (1m29.9s), 059/200 VUs, 14207 complete and 0 interrupted iterations
default   [  37% ] 059/200 VUs  1m29.8s/4m00.0s

running (1m30.9s), 060/200 VUs, 14372 complete and 0 interrupted iterations
default   [  38% ] 060/200 VUs  1m30.8s/4m00.0s

running (1m31.9s), 061/200 VUs, 14529 complete and 0 interrupted iterations
default   [  38% ] 061/200 VUs  1m31.8s/4m00.0s

running (1m32.9s), 062/200 VUs, 14692 complete and 0 interrupted iterations
default   [  39% ] 062/200 VUs  1m32.8s/4m00.0s

running (1m33.9s), 063/200 VUs, 14827 complete and 0 interrupted iterations
default   [  39% ] 063/200 VUs  1m33.8s/4m00.0s

running (1m34.9s), 064/200 VUs, 14974 complete and 0 interrupted iterations
default   [  39% ] 064/200 VUs  1m34.8s/4m00.0s

running (1m35.9s), 065/200 VUs, 15139 complete and 0 interrupted iterations
default   [  40% ] 065/200 VUs  1m35.8s/4m00.0s

running (1m36.9s), 066/200 VUs, 15306 complete and 0 interrupted iterations
default   [  40% ] 066/200 VUs  1m36.8s/4m00.0s

running (1m37.9s), 067/200 VUs, 15475 complete and 0 interrupted iterations
default   [  41% ] 067/200 VUs  1m37.8s/4m00.0s

running (1m38.9s), 068/200 VUs, 15638 complete and 0 interrupted iterations
default   [  41% ] 068/200 VUs  1m38.8s/4m00.0s

running (1m39.9s), 069/200 VUs, 15806 complete and 0 interrupted iterations
default   [  42% ] 069/200 VUs  1m39.8s/4m00.0s

running (1m40.9s), 070/200 VUs, 15975 complete and 0 interrupted iterations
default   [  42% ] 070/200 VUs  1m40.8s/4m00.0s

running (1m41.9s), 071/200 VUs, 16131 complete and 0 interrupted iterations
default   [  42% ] 071/200 VUs  1m41.8s/4m00.0s

running (1m42.9s), 072/200 VUs, 16297 complete and 0 interrupted iterations
default   [  43% ] 072/200 VUs  1m42.8s/4m00.0s

running (1m43.9s), 073/200 VUs, 16444 complete and 0 interrupted iterations
default   [  43% ] 073/200 VUs  1m43.8s/4m00.0s

running (1m44.9s), 074/200 VUs, 16575 complete and 0 interrupted iterations
default   [  44% ] 074/200 VUs  1m44.8s/4m00.0s

running (1m45.9s), 075/200 VUs, 16737 complete and 0 interrupted iterations
default   [  44% ] 075/200 VUs  1m45.8s/4m00.0s

running (1m46.9s), 076/200 VUs, 16901 complete and 0 interrupted iterations
default   [  44% ] 076/200 VUs  1m46.8s/4m00.0s

running (1m47.9s), 077/200 VUs, 17069 complete and 0 interrupted iterations
default   [  45% ] 077/200 VUs  1m47.8s/4m00.0s

running (1m48.9s), 078/200 VUs, 17233 complete and 0 interrupted iterations
default   [  45% ] 078/200 VUs  1m48.8s/4m00.0s

running (1m49.9s), 079/200 VUs, 17397 complete and 0 interrupted iterations
default   [  46% ] 079/200 VUs  1m49.8s/4m00.0s

running (1m50.9s), 080/200 VUs, 17562 complete and 0 interrupted iterations
default   [  46% ] 080/200 VUs  1m50.8s/4m00.0s

running (1m51.9s), 081/200 VUs, 17718 complete and 0 interrupted iterations
default   [  47% ] 081/200 VUs  1m51.8s/4m00.0s

running (1m52.9s), 082/200 VUs, 17880 complete and 0 interrupted iterations
default   [  47% ] 082/200 VUs  1m52.8s/4m00.0s

running (1m53.9s), 083/200 VUs, 18024 complete and 0 interrupted iterations
default   [  47% ] 083/200 VUs  1m53.8s/4m00.0s

running (1m54.9s), 084/200 VUs, 18154 complete and 0 interrupted iterations
default   [  48% ] 084/200 VUs  1m54.8s/4m00.0s

running (1m55.9s), 085/200 VUs, 18317 complete and 0 interrupted iterations
default   [  48% ] 085/200 VUs  1m55.8s/4m00.0s

running (1m56.9s), 086/200 VUs, 18482 complete and 0 interrupted iterations
default   [  49% ] 086/200 VUs  1m56.8s/4m00.0s

running (1m57.9s), 087/200 VUs, 18642 complete and 0 interrupted iterations
default   [  49% ] 087/200 VUs  1m57.8s/4m00.0s

running (1m58.9s), 088/200 VUs, 18807 complete and 0 interrupted iterations
default   [  49% ] 088/200 VUs  1m58.8s/4m00.0s

running (1m59.9s), 089/200 VUs, 18965 complete and 0 interrupted iterations
default   [  50% ] 089/200 VUs  1m59.8s/4m00.0s

running (2m00.9s), 090/200 VUs, 19130 complete and 0 interrupted iterations
default   [  50% ] 090/200 VUs  2m00.8s/4m00.0s

running (2m01.9s), 091/200 VUs, 19287 complete and 0 interrupted iterations
default   [  51% ] 091/200 VUs  2m01.8s/4m00.0s

running (2m02.9s), 092/200 VUs, 19453 complete and 0 interrupted iterations
default   [  51% ] 092/200 VUs  2m02.8s/4m00.0s

running (2m03.9s), 093/200 VUs, 19597 complete and 0 interrupted iterations
default   [  52% ] 093/200 VUs  2m03.8s/4m00.0s

running (2m04.9s), 094/200 VUs, 19732 complete and 0 interrupted iterations
default   [  52% ] 094/200 VUs  2m04.8s/4m00.0s

running (2m05.9s), 095/200 VUs, 19885 complete and 0 interrupted iterations
default   [  52% ] 095/200 VUs  2m05.8s/4m00.0s

running (2m06.9s), 096/200 VUs, 20049 complete and 0 interrupted iterations
default   [  53% ] 096/200 VUs  2m06.8s/4m00.0s

running (2m07.9s), 097/200 VUs, 20216 complete and 0 interrupted iterations
default   [  53% ] 097/200 VUs  2m07.8s/4m00.0s

running (2m08.9s), 098/200 VUs, 20380 complete and 0 interrupted iterations
default   [  54% ] 098/200 VUs  2m08.8s/4m00.0s

running (2m09.9s), 099/200 VUs, 20536 complete and 0 interrupted iterations
default   [  54% ] 099/200 VUs  2m09.8s/4m00.0s

running (2m10.9s), 100/200 VUs, 20701 complete and 0 interrupted iterations
default   [  54% ] 100/200 VUs  2m10.8s/4m00.0s

running (2m11.9s), 101/200 VUs, 20858 complete and 0 interrupted iterations
default   [  55% ] 101/200 VUs  2m11.8s/4m00.0s

running (2m12.9s), 102/200 VUs, 21019 complete and 0 interrupted iterations
default   [  55% ] 102/200 VUs  2m12.8s/4m00.0s

running (2m13.9s), 103/200 VUs, 21183 complete and 0 interrupted iterations
default   [  56% ] 103/200 VUs  2m13.8s/4m00.0s

running (2m14.9s), 104/200 VUs, 21315 complete and 0 interrupted iterations
default   [  56% ] 104/200 VUs  2m14.8s/4m00.0s

running (2m15.9s), 105/200 VUs, 21451 complete and 0 interrupted iterations
default   [  57% ] 105/200 VUs  2m15.8s/4m00.0s

running (2m16.9s), 106/200 VUs, 21619 complete and 0 interrupted iterations
default   [  57% ] 106/200 VUs  2m16.8s/4m00.0s

running (2m17.9s), 107/200 VUs, 21783 complete and 0 interrupted iterations
default   [  57% ] 107/200 VUs  2m17.8s/4m00.0s

running (2m18.9s), 108/200 VUs, 21947 complete and 0 interrupted iterations
default   [  58% ] 108/200 VUs  2m18.8s/4m00.0s

running (2m19.9s), 109/200 VUs, 22112 complete and 0 interrupted iterations
default   [  58% ] 109/200 VUs  2m19.8s/4m00.0s

running (2m20.9s), 110/200 VUs, 22270 complete and 0 interrupted iterations
default   [  59% ] 110/200 VUs  2m20.8s/4m00.0s

running (2m21.9s), 111/200 VUs, 22434 complete and 0 interrupted iterations
default   [  59% ] 111/200 VUs  2m21.8s/4m00.0s

running (2m22.9s), 112/200 VUs, 22591 complete and 0 interrupted iterations
default   [  59% ] 112/200 VUs  2m22.8s/4m00.0s

running (2m23.9s), 113/200 VUs, 22754 complete and 0 interrupted iterations
default   [  60% ] 113/200 VUs  2m23.8s/4m00.0s

running (2m24.9s), 114/200 VUs, 22896 complete and 0 interrupted iterations
default   [  60% ] 114/200 VUs  2m24.8s/4m00.0s

running (2m25.9s), 115/200 VUs, 23026 complete and 0 interrupted iterations
default   [  61% ] 115/200 VUs  2m25.8s/4m00.0s

running (2m26.9s), 116/200 VUs, 23189 complete and 0 interrupted iterations
default   [  61% ] 116/200 VUs  2m26.8s/4m00.0s

running (2m27.9s), 117/200 VUs, 23353 complete and 0 interrupted iterations
default   [  62% ] 117/200 VUs  2m27.8s/4m00.0s

running (2m28.9s), 118/200 VUs, 23513 complete and 0 interrupted iterations
default   [  62% ] 118/200 VUs  2m28.8s/4m00.0s

running (2m29.9s), 119/200 VUs, 23679 complete and 0 interrupted iterations
default   [  62% ] 119/200 VUs  2m29.8s/4m00.0s

running (2m30.9s), 121/200 VUs, 23838 complete and 0 interrupted iterations
default   [  63% ] 121/200 VUs  2m30.8s/4m00.0s

running (2m31.9s), 122/200 VUs, 23998 complete and 0 interrupted iterations
default   [  63% ] 122/200 VUs  2m31.8s/4m00.0s

running (2m32.9s), 123/200 VUs, 24152 complete and 0 interrupted iterations
default   [  64% ] 123/200 VUs  2m32.8s/4m00.0s

running (2m33.9s), 125/200 VUs, 24310 complete and 0 interrupted iterations
default   [  64% ] 125/200 VUs  2m33.8s/4m00.0s

running (2m34.9s), 126/200 VUs, 24452 complete and 0 interrupted iterations
default   [  64% ] 126/200 VUs  2m34.8s/4m00.0s

running (2m35.9s), 127/200 VUs, 24590 complete and 0 interrupted iterations
default   [  65% ] 127/200 VUs  2m35.8s/4m00.0s

running (2m36.9s), 129/200 VUs, 24736 complete and 0 interrupted iterations
default   [  65% ] 129/200 VUs  2m36.8s/4m00.0s

running (2m37.9s), 130/200 VUs, 24898 complete and 0 interrupted iterations
default   [  66% ] 130/200 VUs  2m37.8s/4m00.0s

running (2m38.9s), 131/200 VUs, 25056 complete and 0 interrupted iterations
default   [  66% ] 131/200 VUs  2m38.8s/4m00.0s

running (2m39.9s), 133/200 VUs, 25218 complete and 0 interrupted iterations
default   [  67% ] 133/200 VUs  2m39.8s/4m00.0s

running (2m40.9s), 134/200 VUs, 25379 complete and 0 interrupted iterations
default   [  67% ] 134/200 VUs  2m40.8s/4m00.0s

running (2m41.9s), 135/200 VUs, 25534 complete and 0 interrupted iterations
default   [  67% ] 135/200 VUs  2m41.8s/4m00.0s

running (2m42.9s), 137/200 VUs, 25689 complete and 0 interrupted iterations
default   [  68% ] 137/200 VUs  2m42.8s/4m00.0s

running (2m43.9s), 138/200 VUs, 25850 complete and 0 interrupted iterations
default   [  68% ] 138/200 VUs  2m43.8s/4m00.0s

running (2m44.9s), 139/200 VUs, 25998 complete and 0 interrupted iterations
default   [  69% ] 139/200 VUs  2m44.8s/4m00.0s

running (2m45.9s), 141/200 VUs, 26133 complete and 0 interrupted iterations
default   [  69% ] 141/200 VUs  2m45.8s/4m00.0s

running (2m46.9s), 142/200 VUs, 26270 complete and 0 interrupted iterations
default   [  69% ] 142/200 VUs  2m46.8s/4m00.0s

running (2m47.9s), 143/200 VUs, 26428 complete and 0 interrupted iterations
default   [  70% ] 143/200 VUs  2m47.8s/4m00.0s

running (2m48.9s), 145/200 VUs, 26585 complete and 0 interrupted iterations
default   [  70% ] 145/200 VUs  2m48.8s/4m00.0s

running (2m49.9s), 146/200 VUs, 26745 complete and 0 interrupted iterations
default   [  71% ] 146/200 VUs  2m49.8s/4m00.0s

running (2m50.9s), 147/200 VUs, 26909 complete and 0 interrupted iterations
default   [  71% ] 147/200 VUs  2m50.8s/4m00.0s

running (2m51.9s), 149/200 VUs, 27064 complete and 0 interrupted iterations
default   [  72% ] 149/200 VUs  2m51.8s/4m00.0s

running (2m52.9s), 150/200 VUs, 27220 complete and 0 interrupted iterations
default   [  72% ] 150/200 VUs  2m52.8s/4m00.0s

running (2m53.9s), 151/200 VUs, 27380 complete and 0 interrupted iterations
default   [  72% ] 151/200 VUs  2m53.8s/4m00.0s

running (2m54.9s), 153/200 VUs, 27545 complete and 0 interrupted iterations
default   [  73% ] 153/200 VUs  2m54.8s/4m00.0s

running (2m55.9s), 154/200 VUs, 27671 complete and 0 interrupted iterations
default   [  73% ] 154/200 VUs  2m55.8s/4m00.0s

running (2m56.9s), 155/200 VUs, 27805 complete and 0 interrupted iterations
default   [  74% ] 155/200 VUs  2m56.8s/4m00.0s

running (2m57.9s), 157/200 VUs, 27958 complete and 0 interrupted iterations
default   [  74% ] 157/200 VUs  2m57.8s/4m00.0s

running (2m58.9s), 158/200 VUs, 28114 complete and 0 interrupted iterations
default   [  74% ] 158/200 VUs  2m58.8s/4m00.0s

running (2m59.9s), 159/200 VUs, 28274 complete and 0 interrupted iterations
default   [  75% ] 159/200 VUs  2m59.8s/4m00.0s

running (3m00.9s), 161/200 VUs, 28437 complete and 0 interrupted iterations
default   [  75% ] 161/200 VUs  3m00.8s/4m00.0s

running (3m01.9s), 162/200 VUs, 28597 complete and 0 interrupted iterations
default   [  76% ] 162/200 VUs  3m01.8s/4m00.0s

running (3m02.9s), 163/200 VUs, 28743 complete and 0 interrupted iterations
default   [  76% ] 163/200 VUs  3m02.8s/4m00.0s

running (3m03.9s), 165/200 VUs, 28901 complete and 0 interrupted iterations
default   [  77% ] 165/200 VUs  3m03.8s/4m00.0s

running (3m04.9s), 166/200 VUs, 29061 complete and 0 interrupted iterations
default   [  77% ] 166/200 VUs  3m04.8s/4m00.0s

running (3m05.9s), 167/200 VUs, 29196 complete and 0 interrupted iterations
default   [  77% ] 167/200 VUs  3m05.8s/4m00.0s

running (3m06.9s), 169/200 VUs, 29329 complete and 0 interrupted iterations
default   [  78% ] 169/200 VUs  3m06.8s/4m00.0s

running (3m07.9s), 170/200 VUs, 29489 complete and 0 interrupted iterations
default   [  78% ] 170/200 VUs  3m07.8s/4m00.0s

running (3m08.9s), 171/200 VUs, 29649 complete and 0 interrupted iterations
default   [  79% ] 171/200 VUs  3m08.8s/4m00.0s

running (3m09.9s), 173/200 VUs, 29809 complete and 0 interrupted iterations
default   [  79% ] 173/200 VUs  3m09.8s/4m00.0s

running (3m10.9s), 174/200 VUs, 29965 complete and 0 interrupted iterations
default   [  79% ] 174/200 VUs  3m10.8s/4m00.0s

running (3m11.9s), 175/200 VUs, 30124 complete and 0 interrupted iterations
default   [  80% ] 175/200 VUs  3m11.8s/4m00.0s

running (3m12.9s), 177/200 VUs, 30269 complete and 0 interrupted iterations
default   [  80% ] 177/200 VUs  3m12.8s/4m00.0s

running (3m13.9s), 178/200 VUs, 30428 complete and 0 interrupted iterations
default   [  81% ] 178/200 VUs  3m13.8s/4m00.0s

running (3m14.9s), 179/200 VUs, 30587 complete and 0 interrupted iterations
default   [  81% ] 179/200 VUs  3m14.8s/4m00.0s

running (3m15.9s), 181/200 VUs, 30715 complete and 0 interrupted iterations
default   [  82% ] 181/200 VUs  3m15.8s/4m00.0s

running (3m16.9s), 182/200 VUs, 30853 complete and 0 interrupted iterations
default   [  82% ] 182/200 VUs  3m16.8s/4m00.0s

running (3m17.9s), 183/200 VUs, 31007 complete and 0 interrupted iterations
default   [  82% ] 183/200 VUs  3m17.8s/4m00.0s

running (3m18.9s), 185/200 VUs, 31169 complete and 0 interrupted iterations
default   [  83% ] 185/200 VUs  3m18.8s/4m00.0s

running (3m19.9s), 186/200 VUs, 31328 complete and 0 interrupted iterations
default   [  83% ] 186/200 VUs  3m19.8s/4m00.0s

running (3m20.9s), 187/200 VUs, 31490 complete and 0 interrupted iterations
default   [  84% ] 187/200 VUs  3m20.8s/4m00.0s

running (3m21.9s), 189/200 VUs, 31650 complete and 0 interrupted iterations
default   [  84% ] 189/200 VUs  3m21.8s/4m00.0s

running (3m22.9s), 190/200 VUs, 31799 complete and 0 interrupted iterations
default   [  84% ] 190/200 VUs  3m22.8s/4m00.0s

running (3m23.9s), 191/200 VUs, 31957 complete and 0 interrupted iterations
default   [  85% ] 191/200 VUs  3m23.8s/4m00.0s

running (3m24.9s), 193/200 VUs, 32111 complete and 0 interrupted iterations
default   [  85% ] 193/200 VUs  3m24.8s/4m00.0s

running (3m25.9s), 194/200 VUs, 32241 complete and 0 interrupted iterations
default   [  86% ] 194/200 VUs  3m25.8s/4m00.0s

running (3m26.9s), 195/200 VUs, 32380 complete and 0 interrupted iterations
default   [  86% ] 195/200 VUs  3m26.8s/4m00.0s

running (3m27.9s), 197/200 VUs, 32538 complete and 0 interrupted iterations
default   [  87% ] 197/200 VUs  3m27.8s/4m00.0s

running (3m28.9s), 198/200 VUs, 32692 complete and 0 interrupted iterations
default   [  87% ] 198/200 VUs  3m28.8s/4m00.0s

running (3m29.9s), 199/200 VUs, 32850 complete and 0 interrupted iterations
default   [  87% ] 199/200 VUs  3m29.8s/4m00.0s

running (3m30.9s), 199/200 VUs, 33009 complete and 0 interrupted iterations
default   [  88% ] 199/200 VUs  3m30.8s/4m00.0s

running (3m31.9s), 193/200 VUs, 33168 complete and 0 interrupted iterations
default   [  88% ] 193/200 VUs  3m31.8s/4m00.0s

running (3m32.9s), 187/200 VUs, 33320 complete and 0 interrupted iterations
default   [  89% ] 187/200 VUs  3m32.8s/4m00.0s

running (3m33.9s), 180/200 VUs, 33475 complete and 0 interrupted iterations
default   [  89% ] 180/200 VUs  3m33.8s/4m00.0s

running (3m34.9s), 173/200 VUs, 33625 complete and 0 interrupted iterations
default   [  89% ] 173/200 VUs  3m34.8s/4m00.0s

running (3m35.9s), 167/200 VUs, 33754 complete and 0 interrupted iterations
default   [  90% ] 167/200 VUs  3m35.8s/4m00.0s

running (3m36.9s), 160/200 VUs, 33902 complete and 0 interrupted iterations
default   [  90% ] 160/200 VUs  3m36.8s/4m00.0s

running (3m37.9s), 154/200 VUs, 34058 complete and 0 interrupted iterations
default   [  91% ] 154/200 VUs  3m37.8s/4m00.0s

running (3m38.9s), 145/200 VUs, 34213 complete and 0 interrupted iterations
default   [  91% ] 145/200 VUs  3m38.8s/4m00.0s

running (3m39.9s), 139/200 VUs, 34371 complete and 0 interrupted iterations
default   [  92% ] 139/200 VUs  3m39.8s/4m00.0s

running (3m40.9s), 133/200 VUs, 34528 complete and 0 interrupted iterations
default   [  92% ] 133/200 VUs  3m40.8s/4m00.0s

running (3m41.9s), 123/200 VUs, 34685 complete and 0 interrupted iterations
default   [  92% ] 123/200 VUs  3m41.8s/4m00.0s

running (3m42.9s), 119/200 VUs, 34837 complete and 0 interrupted iterations
default   [  93% ] 119/200 VUs  3m42.8s/4m00.0s

running (3m43.9s), 112/200 VUs, 34989 complete and 0 interrupted iterations
default   [  93% ] 112/200 VUs  3m43.8s/4m00.0s

running (3m44.9s), 105/200 VUs, 35130 complete and 0 interrupted iterations
default   [  94% ] 105/200 VUs  3m44.8s/4m00.0s

running (3m45.9s), 098/200 VUs, 35254 complete and 0 interrupted iterations
default   [  94% ] 098/200 VUs  3m45.8s/4m00.0s

running (3m46.9s), 090/200 VUs, 35414 complete and 0 interrupted iterations
default   [  94% ] 090/200 VUs  3m46.8s/4m00.0s

running (3m47.9s), 084/200 VUs, 35572 complete and 0 interrupted iterations
default   [  95% ] 084/200 VUs  3m47.8s/4m00.0s

running (3m48.9s), 076/200 VUs, 35729 complete and 0 interrupted iterations
default   [  95% ] 076/200 VUs  3m48.8s/4m00.0s

running (3m49.9s), 070/200 VUs, 35878 complete and 0 interrupted iterations
default   [  96% ] 070/200 VUs  3m49.8s/4m00.0s

running (3m50.9s), 062/200 VUs, 36042 complete and 0 interrupted iterations
default   [  96% ] 062/200 VUs  3m50.8s/4m00.0s

running (3m51.9s), 057/200 VUs, 36201 complete and 0 interrupted iterations
default   [  97% ] 057/200 VUs  3m51.8s/4m00.0s

running (3m52.9s), 049/200 VUs, 36355 complete and 0 interrupted iterations
default   [  97% ] 049/200 VUs  3m52.8s/4m00.0s

running (3m53.9s), 043/200 VUs, 36515 complete and 0 interrupted iterations
default   [  97% ] 043/200 VUs  3m53.8s/4m00.0s

running (3m54.9s), 036/200 VUs, 36643 complete and 0 interrupted iterations
default   [  98% ] 036/200 VUs  3m54.8s/4m00.0s

running (3m55.9s), 030/200 VUs, 36778 complete and 0 interrupted iterations
default   [  98% ] 030/200 VUs  3m55.8s/4m00.0s

running (3m56.9s), 023/200 VUs, 36934 complete and 0 interrupted iterations
default   [  99% ] 023/200 VUs  3m56.8s/4m00.0s

running (3m57.9s), 016/200 VUs, 37092 complete and 0 interrupted iterations
default   [  99% ] 016/200 VUs  3m57.8s/4m00.0s

running (3m58.9s), 009/200 VUs, 37252 complete and 0 interrupted iterations
default   [  99% ] 009/200 VUs  3m58.8s/4m00.0s

running (3m59.9s), 002/200 VUs, 37391 complete and 0 interrupted iterations
default   [ 100% ] 002/200 VUs  3m59.8s/4m00.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 74814   311.580546/s
    checks_succeeded...: 100.00% 74814 out of 74814
    checks_failed......: 0.00%   0 out of 74814

    ✓ status 200
    ✓ 본문 있음

    CUSTOM
    feed_auth_duration.............: avg=553.05ms min=15.18ms med=464.21ms max=3.54s p(90)=1.15s p(95)=1.25s

    HTTP
    http_req_duration..............: avg=553.04ms min=15.18ms med=464.19ms max=3.54s p(90)=1.15s p(95)=1.25s
      { expected_response:true }...: avg=553.04ms min=15.18ms med=464.19ms max=3.54s p(90)=1.15s p(95)=1.25s
    http_req_failed................: 0.00%  0 out of 37408
    http_reqs......................: 37408  155.794438/s

    EXECUTION
    iteration_duration.............: avg=553.38ms min=15.53ms med=464.57ms max=3.54s p(90)=1.15s p(95)=1.25s
    iterations.....................: 37407  155.790273/s
    vus............................: 2      min=1          max=199
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 528 MB 2.2 MB/s
    data_sent......................: 12 MB  49 kB/s



running (4m00.1s), 000/200 VUs, 37407 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  4m0s